Repository: WynieCronje/taiga-ui
Catalog: projects/demo/src/locale/messages.*.xlf
Languages: ru

source: This guide will help you correctly install Taiga UI libraries
ru: Здесь описано подключение Taiga UI к проекту.

source: Create a project
ru: Создание проекта

source: Install libraries
ru: Создание проекта

source: Basic styles
ru: Базовые стили

source: Root component
ru: Root компонент

source: Optional components
ru: Опциональные компоненты

source: Icons
ru: Иконки

source: Theming
ru: Темизация

source: We use <a>SCSS</a> as CSS preprocessor for our library. If you make a new project, you can choose it by default with <code>--style scss</code> flag. Otherwise, do not forget about file type if you import styles directly from our library
ru: Мы используем <a>SCSS</a> как CSS препроцессор для нашей библиотеки. Если вы делаете новый проект, то можете выбрать SCSS по-умолчанию с помощью флага <code>--style scss</code>. В ином случае, не забывайте, что импорт наших стилей доступен только из SCSS файлов

source: Install packages of Taiga UI <tui-doc-code></tui-doc-code> <tui-doc-code></tui-doc-code>
ru: Установите пакеты Taiga UI <tui-doc-code></tui-doc-code> <tui-doc-code></tui-doc-code>

source: Getting started
ru: Начало работы

source: Basic
ru: Базовый
